*** DONE figure how to include Devise in a Rails Engine and have it work in the parent app :RAILS:
    CLOCK: [2015-02-04 Wed 01:54]--[2015-02-04 Wed 02:00] =>  0:06
    created_on: [2015-02-04 Wed 01:55]
    link: [[irc:/irc.freenode.net:6667/#rubyonrails][irc session 'irc.freenode.net:6667/#rubyonrails']]

    #+begin_src text
      <jdeen> I have 3 projects to do which are very similar. I thought of making
              them a plugin so that I can mount them. Since I need Authentication I
              added Devise and generated a model as usual. When I include the engine
              in another rails app and mount it and run `rake db:migrate` I get an
              error similar to `uninitialized constant Devise (NameError)`.   [01:43]
      <jdeen> My question is if we are going to add another engine like 'Devise',
              can we use it inside our new engine the same way we would in an Rails
              app?                                                            [01:44]
      <jdeen> Or will I need to install devise seperately in the Rails app?
      <jdeen> Any advice is highly appreciated
      <tabish> I think you can                                                [01:45]
      <tabish> because in Radar's book he used warden inside his engine for
               multi-tenancy
      <pontiki> jdeen: devise is in your .gemspec as a dependency?            [01:46]
      <jdeen> I have added 'devise' to the gemspec
      <jdeen> in the engine
      <pontiki> yeah
      <jdeen> some thing like: `s.add_dependency "devise", "~> 3.4.1"`
      <pontiki> right                                                         [01:47]
      <pontiki> and it does show up in the app's Gemfile.lock?
      <jdeen> pontiki: yes in both the engine repo and the app both have devise
              3.4.1 there                                                     [01:49]
      <pontiki> kk
      <pontiki> you've probably done everything i can think of, but i'll keep
		talking, unless it's bothersome
      <pontiki> jdeen: ran the devise:install in the app?                     [01:50]
      <jdeen> pontiki: I ran it in the engine and it went fine. In the app it gives
              the same error I mentioned.                                     [01:52]
      <jdeen> `uninitialized constant Devise (NameError)`
      <pontiki> crud                                                          [01:54]
      <jdeen> pontiki: I added devise to the Gemfile of the app, and its not giving
              errors                                                          [01:55]

    #+end_src

*** DONE download transcript from Ruby Rogues 243

    https://media.devchat.tv/ruby-rogues/transcript-243-rr-books-that-aren-t-poodr-ruby-rogues.pdf

    CLOCK: [2016-01-23 Sat 03:29]--[2016-01-23 Sat 03:30] =>  0:01

   created_at: [2016-01-23 Sat 03:29]
*** investigate Refile gem                                           :coding:
    CLOCK: [2015-08-20 Thu 18:36]--[2015-08-20 Thu 18:38] =>  0:02
    created_on: [2015-08-20 Thu 18:36]
    link: https://github.com/refile/refile

    Another image uploader/manager. Reason: can upload directly to S3 or
    other cloud store. Written by jnicklas (capybara dude)
*** investigate Rails domain models that can choose a different persistence strategy :swaac:
    CLOCK: [2015-12-28 Mon 07:52]--[2015-12-28 Mon 07:56] =>  0:04

    created_at: [2015-12-28 Mon 07:52]

    Based on a question in irc:

    How would you implement a scenario where you might get Venue
    information from a local datastore, or via an API?

    Two models? An absract model and two inheritors?
    Do the client models need to know where the information came from?
    Could you have a domain model that decides which strategy to use and
    inject it? How would you implement such a thing?

*** TODO write up swaac post on rails_template                  :swaac:rails:
    CLOCK: [2016-01-05 Tue 22:16]--[2016-01-05 Tue 22:16] =>  0:00

   created_at: [2016-01-05 Tue 22:16]


